# **Задание 1** Выполнить все операции указанные выше с целочисленными, дробными и строковыми переменными.

# Сложение двух чисел
print('Сложение двух чисел: ', 6 + 2)  # 8

# Вычитание двух чисел
print('Вычитание двух чисел: ', 6 - 2)  # 4

# Умножение двух чисел
print('Умножение двух чисел: ', 6 * 2)  # 12

# Деление двух чисел
print('Деление двух чисел: ', 6 / 2)  # 3.0

# Целочисленное деление двух чисел
print('Целочисленное деление двух чисел: ', 7 // 2)  # 3

# Получение остатка от деления
print('Получение остатка от деления: ', 7 % 2)  # Получение остатка от деления числа 7 на 2. Результат - 1

# -x
print('-x: ', -7 - 2)

# +x
print('+x: ', 7 + 2)

# abs(x) Возвращает абсолютное значение числа
print('Возвращает абсолютное значение числа: ', abs(-7.25))

# int(x) Превращает число с плавующей точкой в целое число
print('Превращает число с плавующей точкой в целое число: ', int(3.5))

# float(x) Превращает целое число в число с плавующей точкой
print('Превращает целое число в число с плавующей точкой: ', float(3))

# divmod(x, y) Отображает частное и остаток от деления
print('Отображает частное и остаток от деления: ', divmod(5, 2))

# pow(x, y) Возвращает значение x в степени y
print('Возвращает значение x в степени y: ', pow(4, 3))

# x ** y
print('x ** y: ', 2 ** 5)